package modules.capture
{
	/**
	 * 
	 * @author jvirkovskiy
	 * Точка на игровом поле
	 * 
	 */
	
	public class Pt
	{
		////////////////////////////////////////////////////
		// 
		////////////////////////////////////////////////////
		
		public var x:int;		// Координата по горизонтали
		public var y:int;		// Координата по вертикали
		
		////////////////////////////////////////////////////
		// 
		////////////////////////////////////////////////////
		
		/**
		 * Конструктор
		 * @param x координата по горизорнтали
		 * @param y координата по вертикали
		 */
		public function Pt(x:int, y:int)
		{
			this.x = x;
			this.y = y;
		}
	}
}